import streamlit as st
import pandas as pd
import numpy as np
df = pd.DataFrame(
   [
      ["博白盐焗", 22.818819, 108.321826],
      ["肥连烧烤", 22.816777, 108.322105],
      ["糖水铺子", 22.815971, 108.322256],
      ["重庆白妈火锅", 22.813993, 108.318796],
      ["椿上烧鹅", 22.814848, 108.316864]
   ],
    columns=["店名", "latitude", "longitude"])
df.index.name="序号"
st.subheader("👀***各家店所在:red[位置]***")
st.map(df)

data = {
    '月份':['01月', '02月', '03月', '04月', '05月', '06月'],
    '博白盐焗':[4.7, 4.8, 4.7, 4.9, 4.8, 4.9],
    '肥连烧烤':[4.5, 4.4, 4.6, 4.7, 4.6, 4.8],
    '糖水铺子':[4.3, 4.2, 4.4, 4.5, 4.6, 4.7],
    '重庆白妈火锅':[4.6, 4.7, 4.5, 4.6, 4.4, 4.5],
    '椿上烧鹅':[4.8, 4.8, 4.9, 4.9, 4.8, 4.9],
}
df = pd.DataFrame(data)
st.subheader("⭐***各门店月度:red[评分]***")
df_chart = df.set_index("月份")
st.bar_chart(df_chart)

st.subheader("💹***各门店12个月的:red[价格走势]***")
data1 = {
       '博白盐焗':[42, 36, 56, 39, 45, 56, 45, 56, 46, 48, 38, 48],
    '肥连烧烤':[28, 25, 32, 28, 39, 42, 29, 36, 28, 48, 42, 36],
    '糖水铺子':[15, 19, 26, 32, 36, 28, 45, 36, 42, 25, 35, 32],
    '重庆白妈火锅':[25, 30, 28, 29, 35, 36, 32, 27, 36, 28, 37, 31],
    '椿上烧鹅':[40, 45, 35, 36, 41, 28, 26, 37, 25, 32, 28, 37],
}
index = pd.Series(['01月', '02月', '03月', '04月', '05月', '06月', '07月', '08月', '09月', '10月', '11月', '12月'])
df1 = pd.DataFrame(data1, index=index)
st.line_chart(df1)

st.subheader("💸***各门店的:red[平均价格]***")
data = {
'店名': ['博白盐焗', '肥连烧烤', '糖水铺子', '重庆白妈火锅', '椿上烧鹅'],
'人均价格(元)': [30,50,15,70,60], 
}
df = pd.DataFrame(data)
df_chart = df.set_index("店名")
st.line_chart(df_chart)

data = {
    '时段':['11:30-13:30', '14:00-16:00', '17:30-19:30', '19:00-23:00'],
    '博白盐焗':[5, 2, 4, 3],
    '肥连烧烤':[2, 1, 3, 5],
    '糖水铺子':[2, 4, 3, 4],
    '重庆白妈火锅':[3, 1, 5, 4],
    '椿上烧鹅':[5, 2, 4, 3],
}
df = pd.DataFrame(data)
st.subheader("⏰***各家店:red[用餐高峰时段]***")
st.area_chart(df, x='时段')
df.set_index('时段', inplace=True)
